In [28]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv('Iris_data_sample.csv')

In [10]:
df

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,NaN,1.4,0.2,NaN
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,??,3.1,1.5,0.2,Iris-setosa
4,5,5,3.6,###,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [11]:
df.dtypes

Unnamed: 0         int64
SepalLengthCm     object
SepalWidthCm     float64
PetalLengthCm     object
PetalWidthCm     float64
Species           object
dtype: object

In [12]:
df = pd.read_csv('Iris_data_sample.csv',index_col=0)

In [13]:
df

    SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm         Species
1             5.1           3.5           1.4           0.2     Iris-setosa
2             4.9           NaN           1.4           0.2             NaN
3             4.7           3.2           1.3           0.2     Iris-setosa
4              ??           3.1           1.5           0.2     Iris-setosa
5               5           3.6           ###           0.2     Iris-setosa
..            ...           ...           ...           ...             ...
146           6.7           3.0           5.2           2.3  Iris-virginica
147           6.3           2.5             5           1.9  Iris-virginica
148           6.5           3.0           5.2           2.0  Iris-virginica
149           6.2           3.4           5.4           2.3  Iris-virginica
150           5.9           3.0           5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [14]:
df = pd.read_csv('Iris_data_sample.csv',index_col=0, na_values=['??','###'])

In [15]:
df

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
1              5.1           3.5            1.4           0.2     Iris-setosa
2              4.9           NaN            1.4           0.2             NaN
3              4.7           3.2            1.3           0.2     Iris-setosa
4              NaN           3.1            1.5           0.2     Iris-setosa
5              5.0           3.6            NaN           0.2     Iris-setosa
..             ...           ...            ...           ...             ...
146            6.7           3.0            5.2           2.3  Iris-virginica
147            6.3           2.5            5.0           1.9  Iris-virginica
148            6.5           3.0            5.2           2.0  Iris-virginica
149            6.2           3.4            5.4           2.3  Iris-virginica
150            5.9           3.0            5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [17]:
df.isnull().sum()

SepalLengthCm    1
SepalWidthCm     1
PetalLengthCm    2
PetalWidthCm     0
Species          1
dtype: int64

In [22]:
df = pd.read_table('Iris_data_sample.txt', sep=" ", index_col=0)

In [23]:
df

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
1,1,5.1,3.5,1.4,0.2,Iris-setosa
2,2,4.9,3.0,1.4,0.2,Iris-setosa
3,3,4.7,3.2,1.3,0.2,Iris-setosa
4,4,4.6,3.1,1.5,0.2,Iris-setosa
5,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
146,146,6.7,3.0,5.2,2.3,Iris-virginica
147,147,6.3,2.5,5.0,1.9,Iris-virginica
148,148,6.5,3.0,5.2,2.0,Iris-virginica
149,149,6.2,3.4,5.4,2.3,Iris-virginica
150,150,5.9,3.0,5.1,1.8,Iris-virginica

In [97]:
df =pd.read_csv('Toyota.csv', index_col=0)

In [98]:
df

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [99]:
df1 = df.copy(deep=True)

In [100]:
df1.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
           dtype='int64', length=1436)

In [101]:
df1.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [102]:
df1.size

14360

In [103]:
df1.shape

(1436, 10)

In [104]:
df1.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [105]:
df1.ndim

2

In [106]:
df1.at[3,"KM"]

'48000'

In [107]:
df1.iat[3,2]

'48000'

In [108]:
df1.loc[:,'KM']

0       46986
1       72937
2       41711
3       48000
4       38500
        ...
1431    20544
1432       ??
1433    17016
1434       ??
1435        1
Name: KM, Length: 1436, dtype: object

In [109]:
df1.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [110]:
df1.select_dtypes(include=[], exclude=[object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [111]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 163.4+ KB

In [112]:
print(np.unique(df1['KM']))

['1' '10000' '100123' ... '99865' '99971' '??']

In [113]:
print(np.unique(df1['HP']))

['107' '110' '116' '192' '69' '71' '72' '73' '86' '90' '97' '98' '????']

In [114]:
print(np.unique(df1['Doors']))

['2' '3' '4' '5' 'five' 'four' 'three']

In [115]:
print(np.unique(df1['MetColor']))

[ 0.  1. nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan]

In [116]:
df =pd.read_csv('Toyota.csv', index_col=0, na_values=['??','????'])

In [117]:
df

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86.0,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86.0,1.0,0,1300,3,1015
1435,6950,76.0,1.0,Petrol,110.0,0.0,0,1600,5,1114

In [118]:
print(np.unique(df['KM']))

[  1.  15. 225. ...  nan  nan  nan]

In [119]:
print(np.unique(df['HP']))

[ 69.  71.  72.  73.  86.  90.  97.  98. 107. 110. 116. 192.  nan  nan
  nan  nan  nan  nan]

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [121]:
df['Doors'].replace('five',5, inplace = True)

In [122]:
df['Doors'].replace('four',4, inplace = True)

In [123]:
df['Doors'].replace('three',3, inplace = True)

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [125]:
df['Doors']=df['Doors'].astype('int64')

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   int64
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(5), object(1)
memory usage: 123.4+ KB

In [127]:
print(np.unique(df['Doors']))

[2 3 4 5]

In [128]:
df.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [129]:
df.insert(10,'Price_class','')

In [130]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Price        1436 non-null   int64
 1   Age          1336 non-null   float64
 2   KM           1421 non-null   float64
 3   FuelType     1336 non-null   object
 4   HP           1430 non-null   float64
 5   MetColor     1286 non-null   float64
 6   Automatic    1436 non-null   int64
 7   CC           1436 non-null   int64
 8   Doors        1436 non-null   int64
 9   Weight       1436 non-null   int64
 10  Price_class  1436 non-null   object
dtypes: float64(4), int64(5), object(2)
memory usage: 134.6+ KB

In [131]:
for i in range(0,len(df['Price']),1):
    if (df['Price'][i]<=8450):
        df['Price_class'][i]="Low"
    elif (df['Price'][i]>11950):
        df['Price_class'][i]="High"
    else :
        df['Price_class'][i]="Medium"

<ipython-input-131-2e4ff61ebecf>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Price_class'][i]="High"
<ipython-input-131-2e4ff61ebecf>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Price_class'][i]="Low"
<ipython-input-131-2e4ff61ebecf>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Price_class'][i]="Medium"

In [132]:
df['Price_class'].head

0         High
1         High
2         High
3         High
4         High
         ...
1431       Low
1432    Medium
1433    Medium
1434       Low
1435       Low
Name: Price_class, Length: 1436, dtype: object

In [134]:
i=0

while i<len(df['Price']):
    if (df['Price'][i]<=8450):
        df['Price_class'][i]="Low"
    elif (df['Price'][i]>11950):
        df['Price_class'][i]="High"
    else :
        df['Price_class'][i]="Medium"
    i=i+1

<ipython-input-134-347a23d721ba>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Price_class'][i]="High"
<ipython-input-134-347a23d721ba>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Price_class'][i]="Low"
<ipython-input-134-347a23d721ba>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Price_class'][i]="Medium"

In [139]:
df['Price_class']

0         High
1         High
2         High
3         High
4         High
         ...
1431       Low
1432    Medium
1433    Medium
1434       Low
1435       Low
Name: Price_class, Length: 1436, dtype: object

In [141]:
df['Price_class'].value_counts()

Medium    751
Low       369
High      316
Name: Price_class, dtype: int64

In [142]:
df.insert(11,'Age_converter',0)

In [143]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Price          1436 non-null   int64
 1   Age            1336 non-null   float64
 2   KM             1421 non-null   float64
 3   FuelType       1336 non-null   object
 4   HP             1430 non-null   float64
 5   MetColor       1286 non-null   float64
 6   Automatic      1436 non-null   int64
 7   CC             1436 non-null   int64
 8   Doors          1436 non-null   int64
 9   Weight         1436 non-null   int64
 10  Price_class    1436 non-null   object
 11  Age_converter  1436 non-null   int64
dtypes: float64(4), int64(6), object(2)
memory usage: 185.8+ KB

In [145]:
def c_converter(val):
    val_converted = val/12
    return val_converted

In [146]:
df['val_converted'] = c_converter(df['Age'])

In [147]:
df['val_converted']

0       1.916667
1       1.916667
2       2.000000
3       2.166667
4       2.500000
          ...
1431         NaN
1432    6.000000
1433         NaN
1434    5.833333
1435    6.333333
Name: val_converted, Length: 1436, dtype: float64

In [148]:
df['val_converted']  = round( c_converter(df['Age']),1)

In [149]:
df['val_converted']

0       1.9
1       1.9
2       2.0
3       2.2
4       2.5
       ...
1431    NaN
1432    6.0
1433    NaN
1434    5.8
1435    6.3
Name: val_converted, Length: 1436, dtype: float64

In [150]:
df.insert(12,'Km_per_month',0)

In [153]:
def c_converter(val1,val2):
    val_converted = val1/12
    ratio = val2/val1
    
    return [val_converted,ratio]

In [154]:
df['val_converted'],df['Km_per_month']= c_converter(df['Age'],df['KM'])

In [155]:
df.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_class,Age_converter,Km_per_month,val_converted
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High,0,2042.869565,1.916667
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,0,3171.173913,1.916667
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,0,1737.958333,2.000000
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,0,1846.153846,2.166667
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,0,1283.333333,2.500000

In [157]:
df = df.drop(columns=['Age_converter'])

In [158]:
df

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_class,Km_per_month,val_converted
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High,2042.869565,1.916667
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,3171.173913,1.916667
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,1737.958333,2.000000
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,1846.153846,2.166667
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,1283.333333,2.500000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86.0,1.0,0,1300,3,1025,Low,NaN,NaN
1432,10845,72.0,NaN,Petrol,86.0,0.0,0,1300,3,1015,Medium,NaN,6.000000
1433,8500,NaN,17016.0,Petrol,86.0,0.0,0,1300,3,1015,Medium,NaN,NaN
1434,7250,70.0,NaN,NaN,86.0,1.0,0,1300,3,1015,Low,NaN,5.833333
1435,6950,76.0,1.0,Petrol,110.0,0.0,0,1600,5,1114,Low,0.013158,6.333333